In [5]:
import pandas as pd
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

In [ ]:
df=pd.read_excel("")

In [2]:
import random

In [3]:
randomlist=random.sample(range(10,20),5)

In [4]:
randomlist

[15, 17, 13, 18, 11]

In [5]:
array=['cars','banana','jet']
random.choice(array)

'jet'

In [7]:
random.randint(3,7)

7

In [17]:
import numpy
random_f=numpy.random.uniform(75.5,125.5,2)

In [18]:
random_f

array([75.79531185, 88.56140289])

In [20]:
"""
seek
tell
read 
readlines
"""

'\nseek\ntell\nread \nreadlines\n'

In [26]:
import json
from json import JSONEncoder
class Vehicle:
    def __init__(self,name,engine,price):
        self.name=name
        self.engine=engine
        self.price=price
class VehicleEncoder(JSONEncoder):
    def default(self,o):
        print(o.__dict__)
        return o.__dict__
vehi=Vehicle("Toyota","2.5L",32000)

print("Encode vehicle object into JSON")
vj=json.dumps(vehi,indent=1,cls=VehicleEncoder)
print(vj)

Encode vehicle object into JSON
{'name': 'Toyota', 'engine': '2.5L', 'price': 32000}
{
 "name": "Toyota",
 "engine": "2.5L",
 "price": 32000
}

In [ ]:
load-->json string to dict using load  '{keys and values in double quotes}'-->josn string to {} using loads
dump---> dict to json string using dumo  {} --> '{keys and values in doule quotes}'
load-- for json file
loads for json strings

In [3]:
index = pd.MultiIndex.from_tuples([('d', 1), ('d', 2),('e', 2)],names=['n', 'v'])

In [4]:
melt--. gather rows into coloumns
pd.melt(df)

pivot --- Spread rows into columns.
df.pivot(columns='var', values='val')

MultiIndex([('d', 1),
            ('d', 2),
            ('e', 2)],
           names=['n', 'v'])

In [7]:
#melt--> rows will be converted to columns

df = pd.DataFrame({'New york': [25], 'Paris': [27], 'London': [30]})
df

   New york  Paris  London
0        25     27      30

In [8]:
df.melt()

   variable  value
0  New york     25
1     Paris     27
2    London     30

In [10]:
df_larger = pd.DataFrame({
    'New york': [25, 27, 23, 25, 29],
    'Paris': [27, 22, 24, 26, 28],
    'London': [30, 31, 33, 29, 25]
})
df_larger

   New york  Paris  London
0        25     27      30
1        27     22      31
2        23     24      33
3        25     26      29
4        29     28      25

In [11]:
df_larger.melt()

    variable  value
0   New york     25
1   New york     27
2   New york     23
3   New york     25
4   New york     29
5      Paris     27
6      Paris     22
7      Paris     24
8      Paris     26
9      Paris     28
10    London     30
11    London     31
12    London     33
13    London     29
14    London     25

In [13]:
df_larger.melt(var_name='city', value_name='temperature')

        city  temperature
0   New york           25
1   New york           27
2   New york           23
3   New york           25
4   New york           29
5      Paris           27
6      Paris           22
7      Paris           24
8      Paris           26
9      Paris           28
10    London           30
11    London           31
12    London           33
13    London           29
14    London           25

In [ ]:
#Append columns of DataFrames
pd.concat([df1,df2], axis=1)
#Append rows of DataFrame
pd.concat([df1,df2])